Перем Переменная1 Экспорт;
Перем Переменная2, Переменная3;

#Если Клиент ИЛИ Сервер Тогда
    //Используемые термы:
#КонецЕсли 

&НаКлиенте
Процедура Проц1()
    П1 = 42 + 1 - 3 * 4 / 5 % 6 ;
    
    Запрос = 
    "ВЫБРАТЬ 
    | Код
    | ИЗ Справочник.Контрагенты";
    
    // Комментарий первый
    
    Если    П1 = 42 Тогда // Комментарий!
        
    ИначеЕсли Ложь Тогда
        
    Иначе
        Сообщить(ТекущаяДата());
    КонецЕсли; 
    
    
    П = Вычислить("2 + 2");
    
    СтрокаКода = "Сообщить(42)";
    Выполнить(СтрокаКода);
    
    
КонецПроцедуры                                                          

&НаСервере
Функция Функ2(Парам1, Знач Парам2)
    
    Пока Истина ИЛИ Ложь И НЕ Null = Неопределено Цикл
        Для каждого МД Из Метаданные.Документы Цикл
            ВызватьИсключение "Ошибка!";
        КонецЦикла;  
    КонецЦикла; 
    
    Для Счетчик = 1 По 3 Цикл
        Попытка
            
        Исключение
            ТекстОшибки = ОписаниеОшибки();
            ВызватьИсключение;
        КонецПопытки; 
    КонецЦикла; 
    
    Если ТипЗнч(Счетчик) = Тип("ДокументСсылка.АвансовыйОтчет") Тогда
        
    КонецЕсли; 
КонецФункции

&НаКлиентеНаСервереБезКонтекста
&НаКлиентеНаСервере
&НаСервереБезКонтекста
Процедура Проц2() Экспорт
    Обработка = Обработки.КонтрольДокумента.Создать();
    Накладная = Документы.Накладная.СоздатьДокумент();
    ДобавитьОбработчик Накладная.ПриЗаписи, Обработка.ПриЗаписиДокумента; 
    
    msword = Новый COMОбъект("Word.Application");
    ДобавитьОбработчик msword.DocumentChange, ПриИзмененииДокумента;
    
    УдалитьОбработчик Накладная.ПриЗаписи, Обработка.ПриЗаписиДокумента;
КонецПроцедуры

&Перед("Название метода или события")
&После("Название метода или события")
&Вместо("Название метода или события")
&ИзменениеИКонтроль("Название метода")
Процедура ПриИзмененииДокумента()
    СписокСохранения = Новый Структура;
    ХранилищеДанных = Новый ХранилищеЗначения(СписокСохранения);
    ТипЗначения = Тип("КвалификаторыСтроки");
    Параметры = Новый Массив(2);
    Параметры[0] = 20;
    Параметры[1] = ДопустимаяДлина.Переменная;
    КвСтр = Новый(ТипЗначения, Параметры);
КонецПроцедуры
