/* Return "false" */

Parse Arg arguments
If arguments <> "" Then Do
	Say "False.rex,  Version 1.00"
	Say "Port of UNIX' "||'"false"'||" command"
	Say
	Say "Usage:  FALSE.REX  ||  command_to_be_tested"
	Say
	Say "Written by Rob van der Woude"
	Say "http://www.robvanderwoude.com"
End

Exit 1
