/* Return "true" */

Parse Arg arguments
If arguments <> "" Then Do
	Say "True.rex,  Version 1.00"
	Say "Port of UNIX' "||'"true"'||" command"
	Say
	Say "Usage:  TRUE.REX  &&  command_to_be_tested"
	Say
	Say "Written by Rob van der Woude"
	Say "http://www.robvanderwoude.com"
End

Exit 0
